src/main/java/ok/dht/test/saskov/stress_testing/stage2/wrk_put.txt
-- Нагрузочное тестирование put запросами. Stage 2.
-- Было проведено 5 тестов:
-- 1) В 1 поток и 1 соединение при rate 20000. Сервис захлебнулся
-- 2) В 1 потока и 1 соединение  при rate 15000 
-- 3) В 3 потока и 3 соединения при при rate 20000
-- 4) В 8 потоков и 8 соединений при rate 20000 
-- 5) В 16 потоков и 16 соединений при rate 20000


lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 1 -d 60s -t 1 -R 20000 -L -s put_script.lua http://localhost:12345
Running 1m test @ http://localhost:12345
  1 threads and 1 connections
  Thread calibration: mean lat.: 791.957ms, rate sampling interval: 2269ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.38s   631.83ms   3.52s    62.31%
    Req/Sec    19.08k   266.03    19.57k    63.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.41s 
 75.000%    2.88s 
 90.000%    3.28s 
 99.000%    3.50s 
 99.900%    3.52s 
 99.990%    3.52s 
 99.999%    3.52s 
100.000%    3.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1207.295     0.000000           29         1.00
    1500.159     0.100000        95603         1.11
    1750.015     0.200000       193017         1.25
    1945.599     0.300000       286102         1.43
    2226.175     0.400000       384548         1.67
    2406.399     0.500000       477080         2.00
    2451.455     0.550000       524569         2.22
    2574.335     0.600000       574135         2.50
    2674.687     0.650000       620009         2.86
    2787.327     0.700000       667870         3.33
    2877.439     0.750000       715958         4.00
    2920.447     0.775000       740127         4.44
    2947.071     0.800000       766504         5.00
    3016.703     0.825000       787894         5.71
    3139.583     0.850000       810727         6.67
    3196.927     0.875000       837036         8.00
    3207.167     0.887500       846427         8.89
    3280.895     0.900000       858500        10.00
    3352.575     0.912500       870410        11.43
    3391.487     0.925000       882259        13.33
    3405.823     0.937500       894844        16.00
    3436.543     0.943750       905272        17.78
    3438.591     0.950000       907220        20.00
    3446.783     0.956250       911988        22.86
    3452.927     0.962500       919999        26.67
    3479.551     0.968750       924801        32.00
    3483.647     0.971875       929560        35.56
    3485.695     0.975000       931621        40.00
    3487.743     0.978125       939810        45.71
    3487.743     0.981250       939810        53.33
    3487.743     0.984375       939810        64.00
    3491.839     0.985938       940238        71.11
    3493.887     0.987500       943521        80.00
    3493.887     0.989062       943521        91.43
    3504.127     0.990625       944732       106.67
    3514.367     0.992188       946737       128.00
    3516.415     0.992969       947375       142.22
    3518.463     0.993750       948040       160.00
    3520.511     0.994531       950789       182.86
    3520.511     0.995313       950789       213.33
    3520.511     0.996094       950789       256.00
    3520.511     0.996484       950789       284.44
    3520.511     0.996875       950789       320.00
    3522.559     0.997266       953601       365.71
    3522.559     1.000000       953601          inf
#[Mean    =     2383.224, StdDeviation   =      631.827]
#[Max     =     3520.512, Total count    =       953601]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1109553 requests in 1.00m, 70.90MB read
Requests/sec:  18492.65
Transfer/sec:      1.18MB


lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 1 -d 60s -t 1 -R 15000 -L -s put_script.lua http://localhost:12345
Running 1m test @ http://localhost:12345
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.003ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   709.16us  565.84us  10.58ms   91.99%
    Req/Sec    15.83k     1.06k   21.11k    73.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  674.00us
 75.000%    0.94ms
 90.000%    1.12ms
 99.000%    2.56ms
 99.900%    7.43ms
 99.990%   10.24ms
 99.999%   10.53ms
100.000%   10.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.044     0.000000            2         1.00
       0.202     0.100000        75065         1.11
       0.336     0.200000       150179         1.25
       0.458     0.300000       225648         1.43
       0.568     0.400000       300025         1.67
       0.674     0.500000       375436         2.00
       0.726     0.550000       413047         2.22
       0.778     0.600000       450581         2.50
       0.831     0.650000       487753         2.86
       0.886     0.700000       525578         3.33
       0.942     0.750000       562688         4.00
       0.971     0.775000       581478         4.44
       1.001     0.800000       600443         5.00
       1.031     0.825000       619232         5.71
       1.061     0.850000       637910         6.67
       1.092     0.875000       656646         8.00
       1.108     0.887500       666048         8.89
       1.124     0.900000       675151        10.00
       1.141     0.912500       684439        11.43
       1.159     0.925000       693908        13.33
       1.177     0.937500       703424        16.00
       1.185     0.943750       707812        17.78
       1.195     0.950000       712835        20.00
       1.206     0.956250       717329        22.86
       1.219     0.962500       721837        26.67
       1.234     0.968750       726497        32.00
       1.242     0.971875       728971        35.56
       1.251     0.975000       731192        40.00
       1.274     0.978125       733544        45.71
       1.364     0.981250       735863        53.33
       1.571     0.984375       738208        64.00
       1.730     0.985938       739380        71.11
       1.937     0.987500       740550        80.00
       2.227     0.989062       741722        91.43
       2.681     0.990625       742900       106.67
       3.069     0.992188       744071       128.00
       3.297     0.992969       744652       142.22
       3.551     0.993750       745242       160.00
       3.737     0.994531       745824       182.86
       4.535     0.995313       746410       213.33
       5.423     0.996094       746995       256.00
       5.691     0.996484       747292       284.44
       5.923     0.996875       747586       320.00
       6.031     0.997266       747884       365.71
       6.115     0.997656       748172       426.67
       6.291     0.998047       748468       512.00
       6.427     0.998242       748608       568.89
       6.607     0.998437       748755       640.00
       6.859     0.998633       748899       731.43
       7.195     0.998828       749046       853.33
       7.491     0.999023       749192      1024.00
       7.675     0.999121       749265      1137.78
       7.851     0.999219       749340      1280.00
       8.035     0.999316       749412      1462.86
       8.127     0.999414       749489      1706.67
       8.231     0.999512       749558      2048.00
       8.399     0.999561       749595      2275.56
       8.663     0.999609       749632      2560.00
       8.999     0.999658       749668      2925.71
       9.383     0.999707       749705      3413.33
       9.767     0.999756       749741      4096.00
       9.887     0.999780       749761      4551.11
       9.943     0.999805       749779      5120.00
       9.975     0.999829       749800      5851.43
      10.039     0.999854       749816      6826.67
      10.159     0.999878       749836      8192.00
      10.199     0.999890       749842      9102.22
      10.247     0.999902       749852     10240.00
      10.295     0.999915       749860     11702.86
      10.335     0.999927       749871     13653.33
      10.359     0.999939       749879     16384.00
      10.375     0.999945       749884     18204.44
      10.407     0.999951       749888     20480.00
      10.423     0.999957       749893     23405.71
      10.463     0.999963       749897     27306.67
      10.495     0.999969       749906     32768.00
      10.495     0.999973       749906     36408.89
      10.495     0.999976       749906     40960.00
      10.511     0.999979       749910     46811.43
      10.519     0.999982       749914     54613.33
      10.519     0.999985       749914     65536.00
      10.519     0.999986       749914     72817.78
      10.527     0.999988       749916     81920.00
      10.527     0.999989       749916     93622.86
      10.543     0.999991       749918    109226.67
      10.551     0.999992       749920    131072.00
      10.551     0.999993       749920    145635.56
      10.551     0.999994       749920    163840.00
      10.551     0.999995       749920    187245.71
      10.567     0.999995       749922    218453.33
      10.567     0.999996       749922    262144.00
      10.567     0.999997       749922    291271.11
      10.567     0.999997       749922    327680.00
      10.567     0.999997       749922    374491.43
      10.575     0.999998       749923    436906.67
      10.575     0.999998       749923    524288.00
      10.575     0.999998       749923    582542.22
      10.575     0.999998       749923    655360.00
      10.575     0.999999       749923    748982.86
      10.591     0.999999       749924    873813.33
      10.591     1.000000       749924          inf
#[Mean    =        0.709, StdDeviation   =        0.566]
#[Max     =       10.584, Total count    =       749924]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899992 requests in 1.00m, 57.51MB read
Requests/sec:  14999.63
Transfer/sec:      0.96MB


lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 3 -d 60s -t 3 -R 20000 -L -s put_script.lua http://localhost:12345
Running 1m test @ http://localhost:12345
  3 threads and 3 connections
  Thread calibration: mean lat.: 1.011ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.007ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.013ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.99ms  662.49us  14.10ms   73.25%
    Req/Sec     7.04k   702.27    15.33k    67.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95ms
 75.000%    1.35ms
 90.000%    1.76ms
 99.000%    2.12ms
 99.900%    9.66ms
 99.990%   13.27ms
 99.999%   13.91ms
100.000%   14.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.049     0.000000            1         1.00
       0.266     0.100000       100081         1.11
       0.457     0.200000       200440         1.25
       0.636     0.300000       300283         1.43
       0.804     0.400000       400408         1.67
       0.954     0.500000       499959         2.00
       1.021     0.550000       550772         2.22
       1.079     0.600000       600438         2.50
       1.146     0.650000       650064         2.86
       1.230     0.700000       700353         3.33
       1.350     0.750000       750170         4.00
       1.414     0.775000       775155         4.44
       1.479     0.800000       800107         5.00
       1.546     0.825000       825199         5.71
       1.615     0.850000       850227         6.67
       1.686     0.875000       875072         8.00
       1.723     0.887500       887527         8.89
       1.761     0.900000       900076        10.00
       1.800     0.912500       912522        11.43
       1.841     0.925000       925150        13.33
       1.883     0.937500       937613        16.00
       1.905     0.943750       943740        17.78
       1.928     0.950000       950114        20.00
       1.951     0.956250       956269        22.86
       1.976     0.962500       962519        26.67
       2.002     0.968750       968767        32.00
       2.016     0.971875       971845        35.56
       2.030     0.975000       974902        40.00
       2.046     0.978125       978155        45.71
       2.063     0.981250       981211        53.33
       2.083     0.984375       984513        64.00
       2.093     0.985938       985944        71.11
       2.103     0.987500       987400        80.00
       2.115     0.989062       988984        91.43
       2.129     0.990625       990689       106.67
       2.143     0.992188       992090       128.00
       2.153     0.992969       992945       142.22
       2.163     0.993750       993650       160.00
       2.177     0.994531       994492       182.86
       2.195     0.995313       995283       213.33
       2.219     0.996094       995996       256.00
       2.237     0.996484       996417       284.44
       2.257     0.996875       996792       320.00
       2.469     0.997266       997161       365.71
       3.293     0.997656       997553       426.67
       5.223     0.998047       997943       512.00
       6.087     0.998242       998138       568.89
       7.083     0.998437       998333       640.00
       8.163     0.998633       998528       731.43
       9.087     0.998828       998725       853.33
       9.759     0.999023       998920      1024.00
      10.039     0.999121       999020      1137.78
      10.279     0.999219       999115      1280.00
      10.519     0.999316       999214      1462.86
      10.759     0.999414       999311      1706.67
      11.071     0.999512       999409      2048.00
      11.223     0.999561       999456      2275.56
      11.575     0.999609       999505      2560.00
      11.831     0.999658       999554      2925.71
      12.183     0.999707       999604      3413.33
      12.455     0.999756       999652      4096.00
      12.543     0.999780       999676      4551.11
      12.647     0.999805       999701      5120.00
      12.799     0.999829       999725      5851.43
      12.935     0.999854       999750      6826.67
      13.103     0.999878       999774      8192.00
      13.199     0.999890       999787      9102.22
      13.311     0.999902       999800     10240.00
      13.359     0.999915       999810     11702.86
      13.423     0.999927       999823     13653.33
      13.463     0.999939       999834     16384.00
      13.495     0.999945       999841     18204.44
      13.535     0.999951       999847     20480.00
      13.567     0.999957       999853     23405.71
      13.591     0.999963       999860     27306.67
      13.663     0.999969       999865     32768.00
      13.679     0.999973       999868     36408.89
      13.703     0.999976       999871     40960.00
      13.743     0.999979       999875     46811.43
      13.759     0.999982       999878     54613.33
      13.807     0.999985       999881     65536.00
      13.831     0.999986       999883     72817.78
      13.831     0.999988       999883     81920.00
      13.911     0.999989       999886     93622.86
      13.911     0.999991       999886    109226.67
      14.007     0.999992       999888    131072.00
      14.023     0.999993       999890    145635.56
      14.023     0.999994       999890    163840.00
      14.023     0.999995       999890    187245.71
      14.071     0.999995       999892    218453.33
      14.071     0.999996       999892    262144.00
      14.071     0.999997       999892    291271.11
      14.071     0.999997       999892    327680.00
      14.087     0.999997       999893    374491.43
      14.087     0.999998       999893    436906.67
      14.095     0.999998       999894    524288.00
      14.095     0.999998       999894    582542.22
      14.095     0.999998       999894    655360.00
      14.095     0.999999       999894    748982.86
      14.095     0.999999       999894    873813.33
      14.103     0.999999       999895   1048576.00
      14.103     1.000000       999895          inf
#[Mean    =        0.991, StdDeviation   =        0.662]
#[Max     =       14.096, Total count    =       999895]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199963 requests in 1.00m, 76.67MB read
Requests/sec:  19999.58
Transfer/sec:      1.28MB


lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 8 -d 60s -t 8 -R 20000 -L -s put_script.lua http://localhost:12345
Running 1m test @ http://localhost:12345
  8 threads and 8 connections
  Thread calibration: mean lat.: 1.082ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.081ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.082ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.078ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.083ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.082ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.081ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.081ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  522.55us   3.95ms   61.00%
    Req/Sec     2.64k   216.82     3.33k    63.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.50ms
 90.000%    1.82ms
 99.000%    2.11ms
 99.900%    2.23ms
 99.990%    3.12ms
 99.999%    3.66ms
100.000%    3.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.059     0.000000            1         1.00
       0.356     0.100000       100407         1.11
       0.579     0.200000       200214         1.25
       0.792     0.300000       300023         1.43
       0.954     0.400000       400570         1.67
       1.077     0.500000       500144         2.00
       1.140     0.550000       550234         2.22
       1.207     0.600000       600031         2.50
       1.287     0.650000       650136         2.86
       1.392     0.700000       700280         3.33
       1.498     0.750000       750250         4.00
       1.550     0.775000       775015         4.44
       1.604     0.800000       799924         5.00
       1.658     0.825000       824913         5.71
       1.712     0.850000       850019         6.67
       1.765     0.875000       874961         8.00
       1.792     0.887500       887631         8.89
       1.819     0.900000       900219        10.00
       1.847     0.912500       912578        11.43
       1.876     0.925000       925286        13.33
       1.907     0.937500       937676        16.00
       1.924     0.943750       943978        17.78
       1.941     0.950000       949936        20.00
       1.960     0.956250       956254        22.86
       1.981     0.962500       962594        26.67
       2.004     0.968750       968870        32.00
       2.016     0.971875       972007        35.56
       2.028     0.975000       974908        40.00
       2.043     0.978125       978201        45.71
       2.057     0.981250       981155        53.33
       2.073     0.984375       984291        64.00
       2.083     0.985938       986083        71.11
       2.091     0.987500       987516        80.00
       2.101     0.989062       989090        91.43
       2.111     0.990625       990592       106.67
       2.123     0.992188       992195       128.00
       2.129     0.992969       992963       142.22
       2.137     0.993750       993861       160.00
       2.143     0.994531       994466       182.86
       2.153     0.995313       995355       213.33
       2.161     0.996094       996024       256.00
       2.167     0.996484       996443       284.44
       2.173     0.996875       996822       320.00
       2.179     0.997266       997194       365.71
       2.187     0.997656       997623       426.67
       2.195     0.998047       997993       512.00
       2.199     0.998242       998167       568.89
       2.205     0.998437       998383       640.00
       2.211     0.998633       998547       731.43
       2.219     0.998828       998740       853.33
       2.229     0.999023       998931      1024.00
       2.235     0.999121       999023      1137.78
       2.243     0.999219       999121      1280.00
       2.253     0.999316       999209      1462.86
       2.271     0.999414       999307      1706.67
       2.315     0.999512       999406      2048.00
       2.381     0.999561       999452      2275.56
       2.495     0.999609       999501      2560.00
       2.591     0.999658       999550      2925.71
       2.693     0.999707       999599      3413.33
       2.781     0.999756       999647      4096.00
       2.827     0.999780       999672      4551.11
       2.887     0.999805       999696      5120.00
       2.937     0.999829       999721      5851.43
       2.997     0.999854       999745      6826.67
       3.053     0.999878       999770      8192.00
       3.097     0.999890       999782      9102.22
       3.125     0.999902       999794     10240.00
       3.157     0.999915       999806     11702.86
       3.199     0.999927       999818     13653.33
       3.263     0.999939       999830     16384.00
       3.289     0.999945       999837     18204.44
       3.315     0.999951       999843     20480.00
       3.379     0.999957       999849     23405.71
       3.429     0.999963       999855     27306.67
       3.467     0.999969       999861     32768.00
       3.485     0.999973       999864     36408.89
       3.503     0.999976       999867     40960.00
       3.529     0.999979       999870     46811.43
       3.541     0.999982       999873     54613.33
       3.577     0.999985       999876     65536.00
       3.633     0.999986       999878     72817.78
       3.647     0.999988       999879     81920.00
       3.661     0.999989       999881     93622.86
       3.671     0.999991       999882    109226.67
       3.701     0.999992       999884    131072.00
       3.737     0.999993       999885    145635.56
       3.737     0.999994       999885    163840.00
       3.751     0.999995       999886    187245.71
       3.785     0.999995       999887    218453.33
       3.815     0.999996       999888    262144.00
       3.815     0.999997       999888    291271.11
       3.815     0.999997       999888    327680.00
       3.863     0.999997       999889    374491.43
       3.863     0.999998       999889    436906.67
       3.883     0.999998       999890    524288.00
       3.883     0.999998       999890    582542.22
       3.883     0.999998       999890    655360.00
       3.883     0.999999       999890    748982.86
       3.883     0.999999       999890    873813.33
       3.949     0.999999       999891   1048576.00
       3.949     1.000000       999891          inf
#[Mean    =        1.089, StdDeviation   =        0.523]
#[Max     =        3.948, Total count    =       999891]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199969 requests in 1.00m, 76.67MB read
Requests/sec:  19999.60
Transfer/sec:      1.28MB


lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 16 -d 60s -t 16 -R 20000 -L -s put_script.lua http://localhost:12345
Running 1m test @ http://localhost:12345
  16 threads and 16 connections
  Thread calibration: mean lat.: 0.931ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.934ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.931ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.935ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.938ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.933ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.934ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.931ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.934ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.930ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.931ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.939ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  658.02us  28.72ms   89.64%
    Req/Sec     1.30k    96.47     3.56k    63.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93ms
 75.000%    1.25ms
 90.000%    1.47ms
 99.000%    1.66ms
 99.900%    3.72ms
 99.990%   26.88ms
 99.999%   28.51ms
100.000%   28.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.052     0.000000            1         1.00
       0.407     0.100000       100002         1.11
       0.602     0.200000       200054         1.25
       0.720     0.300000       300711         1.43
       0.831     0.400000       400287         1.67
       0.933     0.500000       500834         2.00
       0.983     0.550000       550664         2.22
       1.034     0.600000       600211         2.50
       1.088     0.650000       650313         2.86
       1.152     0.700000       700035         3.33
       1.249     0.750000       750033         4.00
       1.297     0.775000       775061         4.44
       1.337     0.800000       800006         5.00
       1.373     0.825000       825572         5.71
       1.405     0.850000       850013         6.67
       1.437     0.875000       875190         8.00
       1.453     0.887500       887748         8.89
       1.469     0.900000       900120        10.00
       1.486     0.912500       912970        11.43
       1.503     0.925000       925161        13.33
       1.522     0.937500       937857        16.00
       1.532     0.943750       944218        17.78
       1.542     0.950000       950095        20.00
       1.554     0.956250       956611        22.86
       1.566     0.962500       962583        26.67
       1.580     0.968750       968790        32.00
       1.588     0.971875       971991        35.56
       1.596     0.975000       974913        40.00
       1.606     0.978125       978190        45.71
       1.616     0.981250       981157        53.33
       1.628     0.984375       984280        64.00
       1.635     0.985938       985858        71.11
       1.643     0.987500       987433        80.00
       1.652     0.989062       988989        91.43
       1.662     0.990625       990572       106.67
       1.674     0.992188       992079       128.00
       1.681     0.992969       992904       142.22
       1.690     0.993750       993703       160.00
       1.699     0.994531       994447       182.86
       1.710     0.995313       995189       213.33
       1.725     0.996094       995974       256.00
       1.735     0.996484       996366       284.44
       1.748     0.996875       996774       320.00
       1.763     0.997266       997149       365.71
       1.788     0.997656       997532       426.67
       1.845     0.998047       997924       512.00
       1.946     0.998242       998120       568.89
       2.179     0.998437       998313       640.00
       2.499     0.998633       998509       731.43
       2.979     0.998828       998704       853.33
       3.839     0.999023       998899      1024.00
       5.127     0.999121       998997      1137.78
       7.491     0.999219       999094      1280.00
      10.231     0.999316       999192      1462.86
      12.927     0.999414       999291      1706.67
      15.615     0.999512       999387      2048.00
      17.039     0.999561       999437      2275.56
      18.319     0.999609       999486      2560.00
      19.871     0.999658       999535      2925.71
      21.231     0.999707       999583      3413.33
      22.783     0.999756       999631      4096.00
      23.551     0.999780       999656      4551.11
      24.431     0.999805       999680      5120.00
      25.055     0.999829       999706      5851.43
      25.631     0.999854       999729      6826.67
      26.431     0.999878       999754      8192.00
      26.607     0.999890       999766      9102.22
      26.911     0.999902       999778     10240.00
      27.135     0.999915       999790     11702.86
      27.455     0.999927       999802     13653.33
      27.695     0.999939       999814     16384.00
      27.839     0.999945       999821     18204.44
      27.903     0.999951       999827     20480.00
      27.983     0.999957       999835     23405.71
      28.095     0.999963       999840     27306.67
      28.159     0.999969       999845     32768.00
      28.207     0.999973       999849     36408.89
      28.223     0.999976       999852     40960.00
      28.287     0.999979       999856     46811.43
      28.319     0.999982       999857     54613.33
      28.447     0.999985       999860     65536.00
      28.479     0.999986       999862     72817.78
      28.495     0.999988       999864     81920.00
      28.511     0.999989       999865     93622.86
      28.527     0.999991       999866    109226.67
      28.559     0.999992       999868    131072.00
      28.575     0.999993       999870    145635.56
      28.575     0.999994       999870    163840.00
      28.575     0.999995       999870    187245.71
      28.591     0.999995       999871    218453.33
      28.607     0.999996       999872    262144.00
      28.607     0.999997       999872    291271.11
      28.607     0.999997       999872    327680.00
      28.671     0.999997       999873    374491.43
      28.671     0.999998       999873    436906.67
      28.719     0.999998       999874    524288.00
      28.719     0.999998       999874    582542.22
      28.719     0.999998       999874    655360.00
      28.719     0.999999       999874    748982.86
      28.719     0.999999       999874    873813.33
      28.735     0.999999       999875   1048576.00
      28.735     1.000000       999875          inf
#[Mean    =        0.948, StdDeviation   =        0.658]
#[Max     =       28.720, Total count    =       999875]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199976 requests in 1.00m, 76.67MB read
Requests/sec:  20000.12
Transfer/sec:      1.28MB